tests/script.yml

  # Thank you for trying serverless-artillery!
  # This default script is intended to get you started quickly.
  # There is a lot more that Artillery can do.
  # You can find great documentation of the possibilities at:
  # https://artillery.io/docs/
  config:
    target: "https://aws.amazon.com" # this hostname will be used for each part of the flow
    phases:
      -
        duration: 50
        arrivalRate: 10
  mode: acc
  scenarios:
    -
      flow:
        -
          get:
            url: "/"
    -
      flow:
        -
          get:
            url: "/"
    -
      flow:
        -
          get:
            url: "/"